Revit 2027 API
RenderingQualitySettings.IsValidRenderLevel Method
 Validate the render level is between 1 and 40
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidRenderLevel(
	int value
)
Public Function IsValidRenderLevel (
	value As Integer
) As Boolean
public:
bool IsValidRenderLevel(
	int value
)
member IsValidRenderLevel :
        value : int -> bool
Parameters
value Int32
 The render level value to validate.
Return Value
Boolean
 True if the render level value is in the proper range, false otherwise.
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace